https://www.kaggle.com/arthurtok/introduction-to-ensembling-stacking-in-python

In [11]:
import pandas as pd
import numpy as np
import re

import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

import warnings
warnings.filterwarnings('ignore')

In [2]:
df_train = pd.read_csv('train.csv')

df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df_train.shape

(891, 12)

In [4]:
df_test = pd.read_csv('test.csv')

df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
df_test.shape

(418, 11)

In [7]:
round(df_train['Survived'].value_counts(normalize = True),2)

# 0 = No | 1 = Yes

0    0.62
1    0.38
Name: Survived, dtype: float64

## Feature Engineering

In [10]:
df_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [8]:
dict_df = {'key_df_train':df_train,'key_df_test':df_test}

In [27]:
def get_title(Name):
    title_search = re.search(' ([A-Za-z]+)\.',Name)
    if title_search:
        return title_search.group(1)
    return ''

In [39]:
df_train['CategoricalAge'] = pd.cut(df_train['Age'],5)

In [41]:
df_train['CategoricalFare'] = pd.qcut(df_train['Fare'],4)

In [42]:
for df in dict_df.values():
    df['Name_length'] = df['Name'].apply(len)
    df['Title'] = df['Name'].apply(get_title)
    df['Title'] = df['Title'].replace(['Lady','Countess','Capt','Col','Don','Dr','Major','Rev','Sir','Jonkheer','Dona'],'Rare')
    df['Title'] = df['Title'].replace('Mlle','Miss')
    df['Title'] = df['Title'].replace('Ms','Miss')
    df['Title'] = df['Title'].replace('Mme','Mrs')
    df['Title'] = df['Title'].map({'Mr':1,'Miss':2,'Mrs':3,'Master':4,'Rare':5})
    df['Sex'] = df['Sex'].map({'female':0,'male':1} ).astype(int)
    age_avg = df['Age'].mean()
    age_std = df['Age'].std()
    age_null_count = df['Age'].isnull().sum()
    age_null_random_list = np.random.randint(age_avg - age_std,age_avg + age_std,size = age_null_count)
    df['Age'][np.isnan(df['Age'])] = age_null_random_list
    df['Age'] = df['Age'].astype(int)
    df.loc[df['Age'] <= 16.0,'Age'] = 0
    df.loc[(df['Age'] > 16.0) & (df['Age'] <= 32.0),'Age'] = 1
    df.loc[(df['Age'] > 32.0) & (df['Age'] <= 48.0),'Age'] = 2
    df.loc[(df['Age'] > 48.0) & (df['Age'] <= 64.0),'Age'] = 3
    df.loc[df['Age'] > 64.0,'Age'] = 4
    df['FamilySize'] = df['SibSp'] + df['Parch'] + 1
    df['IsAlone'] = 0
    df.loc[df['FamilySize'] == 1,'IsAlone'] = 1
    df['Fare'] = df['Fare'].fillna(df_train['Fare'].median())
    df.loc[df['Fare'] <= 7.91,'Fare'] = 0
    df.loc[(df['Fare'] > 7.91) & (df['Fare'] <= 14.454),'Fare'] = 1
    df.loc[(df['Fare'] > 14.454) & (df['Fare'] <= 31.0),'Fare'] = 2
    df.loc[ df['Fare'] > 31.0,'Fare'] = 3
    df['Fare'] = df['Fare'].astype(int)
    df['Has_Cabin'] = df['Cabin'].apply(lambda x: 0 if type(x) == float else 1)
    df['Embarked'] = df['Embarked'].fillna('S')
    df['Embarked'] = df['Embarked'].map({'S':0,'C':1,'Q':2}).astype(int)